microbit-foundation/cpp-editor-experiment/src/codal-wasm/pack/libraries/codal-microbit-nrf5sdk/nRF5SDK/components/softdevice/s113/headers/ble_gap.h
} ble_gap_conn_sec_mode_t;


/**@brief GAP connection security status.*/
typedef struct
{
  ble_gap_conn_sec_mode_t sec_mode;           /**< Currently active security mode for this connection.*/
  uint8_t                 encr_key_size;      /**< Length of currently active encryption key, 7 to 16 octets (only applicable for bonding procedures). */
} ble_gap_conn_sec_t;

/**@brief Identity Resolving Key. */
typedef struct
{
  uint8_t irk[BLE_GAP_SEC_KEY_LEN];   /**< Array containing IRK. */
} ble_gap_irk_t;


/**@brief Channel mask (40 bits).
 * Every channel is represented with a bit positioned as per channel index defined in Bluetooth Core Specification v5.0,
 * Vol 6, Part B, Section 1.4.1. The LSB contained in array element 0 represents channel index 0, and bit 39 represents
 * channel index 39. If a bit is set to 1, the channel is not used.
 */
typedef uint8_t ble_gap_ch_mask_t[5];


/**@brief GAP advertising parameters. */
typedef struct
{
  ble_gap_adv_properties_t properties;              /**< The properties of the advertising events. */
  ble_gap_addr_t const    *p_peer_addr;             /**< Address of a known peer.
                                                         - When privacy is enabled and the local device uses
                                                           @ref BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE addresses,
                                                           the device identity list is searched for a matching entry. If
                                                           the local IRK for that device identity is set, the local IRK
                                                           for that device will be used to generate the advertiser address
                                                           field in the advertising packet.
                                                         - If @ref ble_gap_adv_properties_t::type is directed, this must be
                                                           set to the targeted scanner or initiator. If the peer address is
                                                           in the device identity list, the peer IRK for that device will be
                                                           used to generate @ref BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE
                                                           target addresses used in the advertising event PDUs. */
  uint32_t                 interval;                /**< Advertising interval in 625 us units. @sa BLE_GAP_ADV_INTERVALS.
                                                         @note If @ref ble_gap_adv_properties_t::type is set to
                                                               @ref BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED_HIGH_DUTY_CYCLE
                                                               advertising, this parameter is ignored. */
  uint16_t                 duration;                /**< Advertising duration in 10 ms units. When timeout is reached,
                                                         an event of type @ref BLE_GAP_EVT_ADV_SET_TERMINATED is raised.
                                                         @sa BLE_GAP_ADV_TIMEOUT_VALUES.
                                                         @note The SoftDevice will always complete at least one advertising
                                                               event even if the duration is set too low. */
  uint8_t                  max_adv_evts;            /**< Maximum advertising events that shall be sent prior to disabling
                                                         advertising. Setting the value to 0 disables the limitation. When
                                                         the count of advertising events specified by this parameter
                                                         (if not 0) is reached, advertising will be automatically stopped
                                                         and an event of type @ref BLE_GAP_EVT_ADV_SET_TERMINATED is raised
                                                         @note If @ref ble_gap_adv_properties_t::type is set to
                                                               @ref BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED_HIGH_DUTY_CYCLE,
                                                               this parameter is ignored. */
  ble_gap_ch_mask_t        channel_mask;            /**< Channel mask for primary channels.
                                                         At least one of the primary channels, that is channel index 37-39, must be used. */
  uint8_t                  filter_policy;           /**< Filter Policy. @sa BLE_GAP_ADV_FILTER_POLICIES. */
  uint8_t                  primary_phy;             /**< Indicates the PHY on which the primary advertising channel packets
                                                         are transmitted. If set to @ref BLE_GAP_PHY_AUTO, @ref BLE_GAP_PHY_1MBPS
                                                         will be used.
                                                         The only supported value by this SoftDevice is @ref BLE_GAP_PHY_1MBPS. */
  uint8_t                  secondary_phy;           /**< This field is ignored on this SoftDevice. */
  uint8_t                  set_id:4;                /**< This field is ignored on this SoftDevice. */
  uint8_t                  scan_req_notification:1; /**< Enable scan request notifications for this advertising set. When a
                                                         scan request is received and the scanner address is allowed
                                                         by the filter policy, @ref BLE_GAP_EVT_SCAN_REQ_REPORT is raised.
                                                         @note This parameter will be ignored when
                                                               @ref ble_gap_adv_properties_t::type is a non-scannable
                                                               advertising type. */
} ble_gap_adv_params_t;


